Revit 2027 API
ParameterTypeId.RailingPathCurvePropertiesHeight Property
 "Rail Height": Built-in param used for overriding railing curve height in a sketch via UI
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RailingPathCurvePropertiesHeight { get; }
Public Shared ReadOnly Property RailingPathCurvePropertiesHeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RailingPathCurvePropertiesHeight {
	ForgeTypeId^ get ();
}
static member RailingPathCurvePropertiesHeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace